--------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/fumiyau/Documents/GitHub/OrderMatters/OrderMattersReplication30Sep2018.log
  log type:  text
 opened on:  30 Sep 2018, 22:28:09

. use "/Users/fumiyau/Desktop/JGSS_LCS_Submission/Data/jgss2009lcs_v3R.dta",clear

. *Data construction
. do "/Users/fumiyau/Documents/GitHub/OrderMatters/1.DataConst.do"

. *Difine id, age. Omit male sample (1198) and respondents without child (445)
. gen id=_n

. gen age = ageb 

. drop if sexa == 1
(1,198 observations deleted)

. drop if ccnumttl==0 | ccnumttl==.
(445 observations deleted)

. 
. *Marital status
. *1 married, 2 divorced, 3 widowed, 4 never married 
. gen marriage = domarry

. *Omit widowed and never married cases (11)
. drop if marriage == 3 | marriage == 4
(11 observations deleted)

. 
. *Timing of child birth (ref: 1982)
. forvalues i=1/5{
  2. rename cc0`i'byr cby`i'
  3. recode cby`i' 8888=. 9999=.
  4. replace cby`i' = (cby`i'-1982)*12
  5. rename cc0`i'bm cbm`i'
  6. recode cbm`i' 88=. 99=.
  7. gen cbirth`i' = cby`i' + cbm`i'
  8. }
(cby1: 5 changes made)
(1,068 real changes made)
(cbm1: 22 changes made)
(22 missing values generated)
(cby2: 4 changes made)
(764 real changes made)
(cbm2: 15 changes made)
(320 missing values generated)
(cby3: 1 changes made)
(251 real changes made)
(cbm3: 5 changes made)
(826 missing values generated)
(cby4: 0 changes made)
(34 real changes made)
(cbm4: 3 changes made)
(1,042 missing values generated)
(cby5: 0 changes made)
(5 real changes made)
(cbm5: 1 changes made)
(1,069 missing values generated)

. *omit cases wityout information about first child birth
. drop if cbirth1==.
(22 observations deleted)

. *omit cases who had twins
. drop if cbirth1==cbirth2
(10 observations deleted)

. 
. /* Number of marriage */
. rename mrg0* mrg*

. /* Age of marriage/divorce/remarriage（at month） */
. forvalues i=1/2{
  2. recode mrg`i'sty 8888=. 9999=.
  3. recode mrg`i'stm 88=. 99=.
  4. replace mrg`i'sty = (mrg`i'sty - 1982)*12
  5. gen mrgst`i' = mrg`i'sty + mrg`i'stm
  6. recode mrg`i'eny 8888=. 9999=.
  7. recode mrg`i'enm 88=. 99=.
  8. replace mrg`i'eny = (mrg`i'eny - 1982)*12
  9. gen mrgen`i' = mrg`i'eny + mrg`i'enm
 10. }
(mrg1sty: 3 changes made)
(mrg1stm: 6 changes made)
(1,038 real changes made)
(6 missing values generated)
(mrg1eny: 5 changes made)
(mrg1enm: 7 changes made)
(82 real changes made)
(961 missing values generated)
(mrg2sty: 0 changes made)
(mrg2stm: 0 changes made)
(26 real changes made)
(1,015 missing values generated)
(mrg2eny: 0 changes made)
(mrg2enm: 0 changes made)
(5 real changes made)
(1,036 missing values generated)

. /*devorce in the past (35 cases）*/
. gen pastdiv = mrg2

. recode pastdiv 2=0
(pastdiv: 1015 changes made)

. 
. /*Bridal pregnancy at first marriage*/
. gen bripreg=0

. recode bripreg 0=. if ccnumttl==0 | ccnumttl==.
(bripreg: 0 changes made)

. recode bripreg 0=1 if cbirth1 < mrgst1+9 & mrgst1~=. & cbirth1~=.
(bripreg: 289 changes made)

. gen bripreg7=0

. recode bripreg7 0=. if ccnumttl==0 | ccnumttl==.
(bripreg7: 0 changes made)

. recode bripreg7 0=1 if cbirth1 < mrgst1+8 & mrgst1~=. & cbirth1~=.
(bripreg7: 259 changes made)

. gen bripreg9=0

. recode bripreg9 0=. if ccnumttl==0 | ccnumttl==.
(bripreg9: 0 changes made)

. recode bripreg9 0=1 if cbirth1 < mrgst1+10 & mrgst1~=. & cbirth1~=.
(bripreg9: 328 changes made)

. /*Bridal pregnancy after second marriage is not included (below)*/
. /*recode bripreg 0=1 if cbirth1 < mrgst2+9 & cbirth1 > mrgen1 & mrgst2~=. & cbirth1~=. & mrgen1 ~=.*/
. 
. //Parity dummies//
. gen ccnum1 = ccnumttl

. recode ccnum1 1/7=1
(ccnum1: 744 changes made)

. gen ccnum2 = ccnumttl

. recode ccnum2 0/1=0 2/7=1
(ccnum2: 1041 changes made)

. 
. *Educational attainment
. *1"Junior high school"2"High school"3"Junior/two year colleges"4"University and more"
. gen redu = 0

. recode redu 0=1 if schtpno == 1
(redu: 14 changes made)

. recode redu 0=2 if schtphs == 1 & schtpvs == 0 & schtpunv == 0 & schtpot == 0 & schtpgs == 0 & schtpct
>  == 0 & schtp2yc == 0 & schtpno == 0
(redu: 408 changes made)

. recode redu 0=3 if schtphs == 1 & schtpvs == 1 & schtpunv == 0 & schtpot == 0 & schtpgs == 0 & schtpct
>  == 0 & schtp2yc == 0 & schtpno == 0
(redu: 210 changes made)

. recode redu 0=3 if schtphs == 0 & schtpvs == 1 & schtpunv == 0 & schtpot == 0 & schtpgs == 0 & schtpct
>  == 0 & schtp2yc == 0 & schtpno == 0
(redu: 12 changes made)

. recode redu 0=4 if schtphs == 1 & schtpvs == 0 & schtpunv == 0 & schtpot == 0 & schtpgs == 0 & (schtpc
> t == 1 | schtp2yc == 1) & schtpno == 0
(redu: 214 changes made)

. recode redu 0=5 if schtphs == 1 & schtpunv == 1 & schtpgs == 0 & schtpno == 0
(redu: 158 changes made)

. recode redu 0=5 if schtphs == 1 & schtpunv == 1 & schtpgs == 1 & schtpno == 0
(redu: 5 changes made)

. recode redu 0=.
(redu: 20 changes made)

. recode redu (3/4=3)(5=4)
(redu: 377 changes made)

. 
. *Spouse education
. *1"Junior high school"2"High school"3"Junior/two year colleges"4"University and more"6"Unknown"
. gen spedu = sslstsch
(66 missing values generated)

. recode spedu 3/4=4 6=5 7=6 8/9=.
(spedu: 53 changes made)

. *Spouse's education is unknown if respondents are married, divorced, or never married but have a child
. replace spedu=6 if marriage == 1 & spedu ==.
(2 real changes made)

. replace spedu=6 if marriage == 2
(66 real changes made)

. replace spedu=6 if marriage == 4 & ccnumttl ~=0 & ccnumttl ~=.
(0 real changes made)

. replace spedu = 3 if pspsch == 1 & (spedu == 1 | spedu == 2)
(129 real changes made)

. recode  spedu (3/4=3)(5=4)
(spedu: 438 changes made)

. 
. *Year of high school graduation
. recode hseny hsenm (99=.)(9999=.)
(hseny: 1 changes made)
(hsenm: 1 changes made)

. gen hsgrady=(hseny-1982)*12 + hsenm
(28 missing values generated)

. gen jsgrady=(jhsgdyr-2)*12 + 3

. *time of school graduation
. gen upon=hsgrady if redu ==2
(634 missing values generated)

. replace upon=jsgrady if redu == 1
(14 real changes made)

. *time of age 16
. gen age16 = (jhsgdyr-2)*12 + 3 + 12

. 
. *birth cohort
. recode dobyear 1966/1970 = 1 1971/1975=2 1976/1980=3, gen(cohort)
(1041 differences between dobyear and cohort)

. *marital year and age
. gen maryear = (mrg1sty/12)+1982
(3 missing values generated)

. gen marage = maryear - dobyear
(3 missing values generated)

. recode maryear 1985/1994=1 1995/1999=2 2000/2004=3 2005/2009=4,gen(marcohort)
(1038 differences between maryear and marcohort)

. recode marage 16/22=1 23/25=2 26/28=3 29/31=4 32/34=5 35/39=6,gen(marcat)
(1038 differences between marage and marcat)

. 
. *time of bith year(classification corresponds to Iwasawa Kamata (2015）
. forvalues i=1/3{
  2. gen bch`i' = (cby`i'/12)+1982
  3. gen birthage`i' = (cby`i'/12)+1982-dobyear
  4. recode bch`i' 1986/1991=1 1992/1994=2 1995/2001=3 2002/2004=4 2005/2009=5
  5. recode birthage`i' 16/22=1 23/25=2 26/28=3 29/31=4 32/34=5 35/41=6,gen(birthcat`i')
  6. }
(bch1: 1041 changes made)
(1041 differences between birthage1 and birthcat1)
(297 missing values generated)
(297 missing values generated)
(bch2: 744 changes made)
(743 differences between birthage2 and birthcat2)
(796 missing values generated)
(796 missing values generated)
(bch3: 245 changes made)
(245 differences between birthage3 and birthcat3)

. 
. *Covariates
. /* Number of jobs */
. forvalues i=1/9{
  2. rename job0`i' noj`i'
  3. recode jb0`i'sty 8888=. 9999=.
  4. recode jb0`i'stm 88=. 99=.
  5. replace jb0`i'stm = 4 if jb0`i'sty ~=. & jb0`i'stm ==.
  6. replace jb0`i'sty = (jb0`i'sty - 1982)*12
  7. gen jobst`i' = jb0`i'sty + jb0`i'stm
  8. }
(jb01sty: 0 changes made)
(jb01stm: 5 changes made)
(5 real changes made)
(1,023 real changes made)
(18 missing values generated)
(jb02sty: 4 changes made)
(jb02stm: 18 changes made)
(14 real changes made)
(757 real changes made)
(284 missing values generated)
(jb03sty: 4 changes made)
(jb03stm: 12 changes made)
(8 real changes made)
(452 real changes made)
(589 missing values generated)
(jb04sty: 2 changes made)
(jb04stm: 8 changes made)
(6 real changes made)
(210 real changes made)
(831 missing values generated)
(jb05sty: 1 changes made)
(jb05stm: 2 changes made)
(1 real change made)
(93 real changes made)
(948 missing values generated)
(jb06sty: 0 changes made)
(jb06stm: 0 changes made)
(0 real changes made)
(34 real changes made)
(1,007 missing values generated)
(jb07sty: 1 changes made)
(jb07stm: 1 changes made)
(0 real changes made)
(8 real changes made)
(1,033 missing values generated)
(jb08sty: 0 changes made)
(jb08stm: 0 changes made)
(0 real changes made)
(2 real changes made)
(1,039 missing values generated)
(jb09sty: 0 changes made)
(jb09stm: 0 changes made)
(0 real changes made)
(0 real changes made)
(1,041 missing values generated)

. 
. gen beginjob = jobst1
(18 missing values generated)

. 
. gen begin16 = (dobyear+16-1982)*12

. recode spagex 999=.
(spagex: 9 changes made)

. replace begin16=(2009-spagex+16-1982)*12 if sex == 1
(0 real changes made)

. 
. /* Age at job quit */
. forvalues i=1/9{
  2. recode jb0`i'eny 8888=. 9999=.
  3. recode jb0`i'enm 88=. 99=.
  4. replace jb0`i'enm = 3 if jb0`i'eny ~=. & jb0`i'enm ==.
  5. replace jb0`i'eny = (jb0`i'eny - 1982)*12
  6. gen joben`i' = jb0`i'eny + jb0`i'enm
  7. replace joben`i' = 326 if jb0`i'ong == 2
  8. }
(jb01eny: 3 changes made)
(jb01enm: 19 changes made)
(16 real changes made)
(923 real changes made)
(118 missing values generated)
(97 real changes made)
(jb02eny: 4 changes made)
(jb02enm: 16 changes made)
(12 real changes made)
(564 real changes made)
(477 missing values generated)
(193 real changes made)
(jb03eny: 1 changes made)
(jb03enm: 8 changes made)
(7 real changes made)
(289 real changes made)
(752 missing values generated)
(166 real changes made)
(jb04eny: 1 changes made)
(jb04enm: 3 changes made)
(2 real changes made)
(123 real changes made)
(918 missing values generated)
(88 real changes made)
(jb05eny: 2 changes made)
(jb05enm: 3 changes made)
(1 real change made)
(51 real changes made)
(990 missing values generated)
(41 real changes made)
(jb06eny: 0 changes made)
(jb06enm: 0 changes made)
(0 real changes made)
(21 real changes made)
(1,020 missing values generated)
(13 real changes made)
(jb07eny: 1 changes made)
(jb07enm: 1 changes made)
(0 real changes made)
(2 real changes made)
(1,039 missing values generated)
(6 real changes made)
(jb08eny: 0 changes made)
(jb08enm: 0 changes made)
(0 real changes made)
(1 real change made)
(1,040 missing values generated)
(1 real change made)
(jb09eny: 0 changes made)
(jb09enm: 0 changes made)
(0 real changes made)
(0 real changes made)
(1,041 missing values generated)
(0 real changes made)

. 
. /* SSM 8 classification (including non-employed) */
. /* 1"専門" 2"管理" 3"事務" 4"販売" 5"熟練" 6"半熟練" 7"非熟練" 8"農林" 9"無職"*/
. forvalues i=1/9{
  2. gen jobssm`i' = jb0`i's0oc 
  3. recode jobssm`i' (501/544 = 1)(609/610 = 1)(615 = 1)(703 = 1) (545/553 = 2)(608 = 2)(554/565 = 3)(5
> 86 = 3)(590 = 3)(593/598 = 3)(616/619 = 3)(701 = 3) (566/577 = 4)(582/585 = 4)(587/589 = 4) (579 = 5)(
> 581 = 5)(623/624 = 5)(626 = 5)(628 = 5)(631 = 5)(633 = 5)(635/644 = 5)(647 = 5)(651 = 5)(654/656 = 5)(
> 658 = 5)(660/666= 5)(668 = 5)(670/675 = 5)(677/681 = 5)(684 = 5)(702 = 5) (580 = 6)(606/607 = 6)(611/6
> 14 = 6)(625 = 6)(627 = 6)(629/630 = 6)(632 = 6)(634 = 6)(645/646 = 6)(648/650 = 6)(652/653 = 6)(657 = 
> 6)(659 = 6)(667 = 6)(669 = 6)(672 = 6)(676 = 6)(704 = 6)(706=6) (578 = 7)(591/592 = 7)(620/622 = 7)(68
> 2/683 = 7)(685/688 = 7)(599/605 = 8)(998 =9)(689 =.)(987 =.)(999 =.)(988=.)(701 = 4)(702 = 5)(703 = 2)
> (704 = 7)(705 =.)(706 = 8)(707 =.)(801 = 4)(802 = 4)(803 = 4)(804 = 4)
  4. rename jb0`i's0tp type`i'
  5. recode type`i' (8=.) (99=.) 
  6. gen jobpres`i' = jb0`i's0oc 
  7. }
(18 missing values generated)
(jobssm1: 1023 changes made)
(type1: 8 changes made)
(18 missing values generated)
(280 missing values generated)
(jobssm2: 761 changes made)
(type2: 6 changes made)
(280 missing values generated)
(585 missing values generated)
(jobssm3: 456 changes made)
(type3: 6 changes made)
(585 missing values generated)
(829 missing values generated)
(jobssm4: 212 changes made)
(type4: 3 changes made)
(829 missing values generated)
(947 missing values generated)
(jobssm5: 94 changes made)
(type5: 2 changes made)
(947 missing values generated)
(1,007 missing values generated)
(jobssm6: 34 changes made)
(type6: 0 changes made)
(1,007 missing values generated)
(1,032 missing values generated)
(jobssm7: 9 changes made)
(type7: 0 changes made)
(1,032 missing values generated)
(1,039 missing values generated)
(jobssm8: 2 changes made)
(type8: 0 changes made)
(1,039 missing values generated)
(1,041 missing values generated)
(jobssm9: 0 changes made)
(type9: 0 changes made)
(1,041 missing values generated)

. recode type1 .=0 if noj1 == 2
(type1: 18 changes made)

. recode jobssm1 .=9 if noj1 == 2
(jobssm1: 18 changes made)

. recode jobssm* (1/2=1)(3=2)(4=3)(5/8=4)(9=5)
(jobssm1: 797 changes made)
(jobssm2: 611 changes made)
(jobssm3: 378 changes made)
(jobssm4: 179 changes made)
(jobssm5: 81 changes made)
(jobssm6: 31 changes made)
(jobssm7: 8 changes made)
(jobssm8: 1 changes made)
(jobssm9: 0 changes made)

. 
. /*Living with parents*/
. recode plv01jh 8=. 9=.
(plv01jh: 5 changes made)

. forvalues i=1/4{
  2. recode plv0`i'sty 8888=. 9999=.
  3. recode plv0`i'eny 8888=. 9999=.
  4. recode plv0`i'stm 88=. 99=.
  5. recode plv0`i'enm 88=. 99=.
  6. gen plsty`i' = plv0`i'sty
  7. }
(plv01sty: 1 changes made)
(plv01eny: 1 changes made)
(plv01stm: 0 changes made)
(plv01enm: 14 changes made)
(1,016 missing values generated)
(plv02sty: 7 changes made)
(plv02eny: 1 changes made)
(plv02stm: 12 changes made)
(plv02enm: 3 changes made)
(901 missing values generated)
(plv03sty: 0 changes made)
(plv03eny: 0 changes made)
(plv03stm: 0 changes made)
(plv03enm: 0 changes made)
(1,032 missing values generated)
(plv04sty: 0 changes made)
(plv04eny: 0 changes made)
(plv04stm: 0 changes made)
(plv04enm: 0 changes made)
(1,041 missing values generated)

. 
. replace plsty1 = (((2009 - age) + 15)-1982)*12 if plv01jh == 2
(985 real changes made)

. replace plsty1 = (plv01sty-1982)*12 if plv01jh == 1
(25 real changes made)

. replace plsty2 = (plv02sty-1982)*12
(140 real changes made)

. replace plsty3 = (plv03sty-1982)*12
(9 real changes made)

. replace plsty4 = (plv04sty-1982)*12
(0 real changes made)

. 
. forvalues i=1/4{
  2. gen pleny`i' = plv0`i'eny
  3. replace pleny`i' = (plv0`i'eny-1982)*12 
  4. recode plv0`i'ong 8=. 9=.
  5. replace pleny`i' = 326 if plv0`i'ong == 2
  6. }
(80 missing values generated)
(961 real changes made)
(plv01ong: 9 changes made)
(45 real changes made)
(951 missing values generated)
(90 real changes made)
(plv02ong: 1 changes made)
(55 real changes made)
(1,039 missing values generated)
(2 real changes made)
(plv03ong: 0 changes made)
(7 real changes made)
(1,041 missing values generated)
(0 real changes made)
(plv04ong: 0 changes made)
(0 real changes made)

. 
. /*deleting variables*/
. drop psncns cnsdbcar cnsdbmcy cnsdbftv cnsdbdry cnsdbstk cnsdbno exrsmeal exrshous exrsutl exrsclth ex
> rscomm exrsmed exrsedu exrsent exrsot exrsno exwtfood exwthous exwtappl exwtcar exwtfshn exwtlssn exwt
> frd exwttrav exwtsprt exwtsmc exwthk exwtedu exwtpet exwtot exwtno jhclbphy jhclbcul

. drop cndflx cndsmpr cndsmamt cndsmhdy cndjnt cndunrst cndins cndspt cndknlg cndtrn cndrep cndabl cndef
> t cndacmp cndwrth cndblc cowkamt cowkidea cowkspt skscdoc sksceng sksccoop skscintv skscvers sksclead 
> skscmnnr  skscrcpt skscchrc skscsoc sksclaw skscrght skscno skwkdoc skwkeng skwkcoop skwkintv skwkvers
>  skwklead skwkmnnr skwkrcpt skwkchrc skwksoc skwklaw skwkrght skwkno skwknw skwtdoc skwteng skwtcoop s
> kwtintv skwtvers  skwtlead skwtmnnr skwtrcpt skwtchrc skwtsoc skwtlaw skwtrght skwtno tmalwk tmalhby t
> malfam tmalhw

. drop hrtv fq5read fq5comic docompj docompp dophs dononex doinbrs doinshop doinbank doinhpb doinpic doi
> nbbs doincs doinnone fq6email netfrnd comabprg comabset comabins comabgr comabdoc comabno opplnet menh
> lnrv menhlclm menhldp menhlpls menhldwn xtraum5y st5areay st5leisy st5lifey st5ecny st5friy st5hlthy s
> t5ssrel op5happz arbptjb xworkl

. drop tpjob tpjobp tpjsfam tpjsfrd tpjswk tpjsrec tpjsoff tpjsweb tpjsad tpjspub tpjsprv tpjspt tpjsfb 
> tpjsnew tpjsot tpjsdk tpjsapot

. drop jb01sjno jb01sjdp jb01sjpt jb01sjfb jb01sjot jb02sjno jb02sjdp jb02sjpt jb02sjfb jb02sjot jb03sjn
> o jb03sjdp jb03sjpt jb03sjfb jb03sjot jb04sjno jb04sjdp jb04sjpt jb04sjfb jb04sjot jb05sjno jb05sjdp j
> b05sjpt  jb05sjfb jb05sjot jb06sjno jb06sjdp jb06sjpt jb06sjfb jb06sjot jb07sjno jb07sjdp jb07sjpt jb0
> 7sjfb jb07sjot jb08sjno jb08sjdp jb08sjpt jb08sjfb jb08sjot jb09sjno jb09sjdp jb09sjpt jb09sjfb jb09sj
> ot jb10sjno jb10sjdp jb10sjpt jb10sjfb jb10sjot jb11sjno jb11sjdp jb11sjpt jb11sjfb jb11sjot jb12sjno 
> jb12sjdp jb12sjpt jb12sjfb jb12sjot jb13sjno jb13sjdp jb13sjpt jb13sjfb jb13sjot jb14sjno jb14sjdp jb1
> 4sjpt jb14sjfb jb14sjot jb15sjno jb15sjdp jb15sjpt jb15sjfb jb15sjot jb16sjno jb16sjdp jb16sjpt jb16sj
> fb jb16sjot jb17sjno jb17sjdp jb17sjpt jb17sjfb jb17sjot jb18sjno jb18sjdp jb18sjpt jb18sjfb jb18sjot 
> jb19sjno jb19sjdp jb19sjpt jb19sjfb jb19sjot jb20sjno jb20sjdp jb20sjpt jb20sjfb jb20sjot

. drop jb10sty jb10stm jb10ong jb10eny jb10enm jb11sty jb11stm jb11ong jb11eny jb11enm jb12sty jb12stm j
> b12ong jb12eny jb12enm jb13sty jb13stm jb13ong jb13eny jb13enm jb14sty jb14stm jb14ong jb14eny jb14enm
>  jb15sty jb15stm jb15ong jb15eny jb15enm jb16sty jb16stm jb16ong jb16eny jb16enm jb17sty jb17stm jb17o
> ng jb17eny jb17enm jb18sty jb18stm jb18ong jb18eny jb18enm jb19sty jb19stm jb19ong jb19eny jb19enm jb1
> 0s0tp jb10s0tl jb10s0oc jb10s1 jb10s1tp jb10s1tl jb10s1oc jb10s1y jb10s1m jb10s2 jb10s2tp jb10s2tl jb1
> 0s2oc jb10s2y jb10s2m jb10s3 jb10s3tp jb10s3tl jb10s3oc jb10s3y jb10s3m jb10s4 jb10s4tp jb10s4tl jb10s
> 4oc jb10s4y jb10s4m jb11s0tp jb11s0tl jb11s0oc jb11s1 jb11s1tp jb11s1tl jb11s1oc jb11s1y jb11s1m jb11s
> 2 jb11s2tp jb11s2tl jb11s2oc jb11s2y jb11s2m jb11s3 jb11s3tp jb11s3tl jb11s3oc jb11s3y jb11s3m jb11s4 
> jb11s4tp jb11s4tl jb11s4oc jb11s4y jb11s4m jb12s0tp jb12s0tl jb12s0oc jb12s1 jb12s1tp jb12s1tl jb12s1o
> c jb12s1y jb12s1m jb12s2 jb12s2tp jb12s2tl jb12s2oc jb12s2y jb12s2m jb12s3 jb12s3tp jb12s3tl jb12s3oc 
> jb12s3y jb12s3m jb12s4 jb12s4tp jb12s4tl jb12s4oc jb12s4y jb12s4m jb13s0tp jb13s0tl jb13s0oc jb13s1 jb
> 13s1tp jb13s1tl jb13s1oc jb13s1y jb13s1m jb13s2 jb13s2tp jb13s2tl jb13s2oc jb13s2y jb13s2m jb13s3 jb13
> s3tp jb13s3tl jb13s3oc jb13s3y jb13s3m jb13s4 jb13s4tp jb13s4tl jb13s4oc jb13s4y jb13s4m jb14s0tp jb14
> s0tl jb14s0oc jb14s1 jb14s1tp jb14s1tl jb14s1oc jb14s1y jb14s1m jb14s2 jb14s2tp jb14s2tl jb14s2oc jb14
> s2y jb14s2m jb14s3 jb14s3tp jb14s3tl jb14s3oc jb14s3y jb14s3m jb14s4 jb14s4tp jb14s4tl jb14s4oc jb14s4
> y jb14s4m jb15s0tp jb15s0tl jb15s0oc jb15s1 jb15s1tp jb15s1tl jb15s1oc jb15s1y jb15s1m jb15s2 jb15s2tp
>  jb15s2tl jb15s2oc jb15s2y jb15s2m jb15s3 jb15s3tp jb15s3tl jb15s3oc jb15s3y jb15s3m jb15s4 jb15s4tp j
> b15s4tl jb15s4oc jb15s4y jb15s4m jb16s0tp jb16s0tl jb16s0oc jb16s1 jb16s1tp jb16s1tl jb16s1oc jb16s1y 
> jb16s1m jb16s2 jb16s2tp jb16s2tl jb16s2oc jb16s2y jb16s2m jb16s3 jb16s3tp jb16s3tl jb16s3oc jb16s3y jb
> 16s3m jb16s4 jb16s4tp jb16s4tl jb16s4oc jb16s4y jb16s4m jb17s0tp jb17s0tl jb17s0oc jb17s1 jb17s1tp jb1
> 7s1tl jb17s1oc jb17s1y jb17s1m jb17s2 jb17s2tp jb17s2tl jb17s2oc jb17s2y jb17s2m jb17s3 jb17s3tp jb17s
> 3tl jb17s3oc jb17s3y jb17s3m jb17s4 jb17s4tp jb17s4tl jb17s4oc jb17s4y jb17s4m jb18s0tp jb18s0tl jb18s
> 0oc jb18s1 jb18s1tp jb18s1tl jb18s1oc jb18s1y jb18s1m jb18s2 jb18s2tp jb18s2tl jb18s2oc jb18s2y jb18s2
> m jb18s3 jb18s3tp jb18s3tl jb18s3oc jb18s3y jb18s3m jb18s4 jb18s4tp jb18s4tl jb18s4oc jb18s4y jb18s4m 
> jb19s0tp jb19s0tl jb19s0oc jb19s1 jb19s1tp jb19s1tl jb19s1oc jb19s1y jb19s1m jb19s2 jb19s2tp jb19s2tl 
> jb19s2oc jb19s2y jb19s2m jb19s3 jb19s3tp jb19s3tl jb19s3oc jb19s3y jb19s3m jb19s4 jb19s4tp jb19s4tl jb
> 19s4oc jb19s4y jb19s4m 

. 
end of do-file

. *Expand the data
. do "/Users/fumiyau/Documents/GitHub/OrderMatters/2.Expand.do"

. drop if redu ==. 
(20 observations deleted)

. drop if spedu ==.
(0 observations deleted)

. drop if ageb ==.
(0 observations deleted)

. drop if marcohort == .
(3 observations deleted)

. drop if marcat == .
(0 observations deleted)

. drop if bripreg ==.
(0 observations deleted)

. ***Create person-month data using length***
. gen tf = 326 - begin16 + 1

. expand tf
(262,868 observations created)

. sort id 

. by id: gen length = begin16 + _n - 1

. sort iduse length

. 
. do "/Users/fumiyau/Documents/GitHub/OrderMatters/3.OccupationHistory.do"

. *This syntax is checked by the author (Fumiya Uchikoshi), but based on the file shared by Ryota Mugiya
> ma
. /* Employement dummy*/
. gen jobstst2 = 0

. recode jobstst2 0=1 if jobst1 <= length & length <= joben1 & joben1 ~=. & jobst1 ~=. 
(jobstst2: 61429 changes made)

. recode jobstst2 0=1 if jobst2 <= length & length <= joben2 & joben2 ~=. & jobst2 ~=.
(jobstst2: 33816 changes made)

. recode jobstst2 0=1 if jobst3 <= length & length <= joben3 & joben3 ~=. & jobst3 ~=.
(jobstst2: 19455 changes made)

. recode jobstst2 0=1 if jobst4 <= length & length <= joben4 & joben4 ~=. & jobst4 ~=.
(jobstst2: 7792 changes made)

. recode jobstst2 0=1 if jobst5 <= length & length <= joben5 & joben5 ~=. & jobst5 ~=.
(jobstst2: 3785 changes made)

. recode jobstst2 0=1 if jobst6 <= length & length <= joben6 & joben6 ~=. & jobst6 ~=.
(jobstst2: 881 changes made)

. recode jobstst2 0=1 if jobst7 <= length & length <= joben7 & joben7 ~=. & jobst7 ~=.
(jobstst2: 206 changes made)

. recode jobstst2 0=1 if jobst8 <= length & length <= joben8 & joben8 ~=. & jobst8 ~=.
(jobstst2: 33 changes made)

. recode jobstst2 0=1 if jobst9 <= length & length <= joben9 & joben9 ~=. & jobst9 ~=.
(jobstst2: 0 changes made)

. 
. /*Tenure*/
. bysort id: gen tenure1 = length - jobst1 + 1 if jobstst2 == 1 & joben1 >= length & jobst1 <= length & 
> joben1 ~=. & jobst1 ~=. 
(202,457 missing values generated)

. bysort id: gen tenure2 = length - jobst2  if jobstst2 == 1 & joben2 >= length & jobst2 < length & jobe
> n2 ~=. & jobst2 ~=. 
(230,626 missing values generated)

. bysort id: gen tenure3 = length - jobst3  if jobstst2 == 1 & joben3 >= length & jobst3 < length & jobe
> n3 ~=. & jobst3 ~=. 
(244,726 missing values generated)

. bysort id: gen tenure4 = length - jobst4  if jobstst2 == 1 & joben4 >= length & jobst4 < length & jobe
> n4 ~=. & jobst4 ~=. 
(256,269 missing values generated)

. bysort id: gen tenure5 = length - jobst5  if jobstst2 == 1 & joben5 >= length & jobst5 < length & jobe
> n5 ~=. & jobst5 ~=. 
(260,180 missing values generated)

. bysort id: gen tenure6 = length - jobst6  if jobstst2 == 1 & joben6 >= length & jobst6 < length & jobe
> n6 ~=. & jobst6 ~=. 
(263,035 missing values generated)

. bysort id: gen tenure7 = length - jobst7  if jobstst2 == 1 & joben7 >= length & jobst7 < length & jobe
> n7 ~=. & jobst7 ~=. 
(263,688 missing values generated)

. bysort id: gen tenure8 = length - jobst8  if jobstst2 == 1 & joben8 >= length & jobst8 < length & jobe
> n8 ~=. & jobst8 ~=. 
(263,855 missing values generated)

. bysort id: gen tenure9 = length - jobst9  if jobstst2 == 1 & joben9 >= length & jobst9 < length & jobe
> n9 ~=. & jobst9 ~=. 
(263,886 missing values generated)

. 
. gen tenure = .
(263,886 missing values generated)

. replace tenure = tenure1 if jobstst2 == 1 & joben1 >= length & jobst1 <= length & joben1 ~=. & jobst1 
> ~=.  
(61,429 real changes made)

. replace tenure = tenure2 if jobstst2 == 1 & joben2 >= length & jobst2 < length  & joben2 ~=. & jobst2 
> ~=. 
(33,260 real changes made)

. replace tenure = tenure3 if jobstst2 == 1 & joben3 >= length & jobst3 < length  & joben3 ~=. & jobst3 
> ~=. 
(19,160 real changes made)

. replace tenure = tenure4 if jobstst2 == 1 & joben4 >= length & jobst4 < length  & joben4 ~=. & jobst4 
> ~=. 
(7,617 real changes made)

. replace tenure = tenure5 if jobstst2 == 1 & joben5 >= length & jobst5 < length  & joben5 ~=. & jobst5 
> ~=. 
(3,706 real changes made)

. replace tenure = tenure6 if jobstst2 == 1 & joben6 >= length & jobst6 < length  & joben6 ~=. & jobst6 
> ~=. 
(851 real changes made)

. replace tenure = tenure7 if jobstst2 == 1 & joben7 >= length & jobst7 < length  & joben7 ~=. & jobst7 
> ~=. 
(198 real changes made)

. replace tenure = tenure8 if jobstst2 == 1 & joben8 >= length & jobst8 < length  & joben8 ~=. & jobst8 
> ~=. 
(31 real changes made)

. replace tenure = tenure9 if jobstst2 == 1 & joben9 >= length & jobst9 < length  & joben9 ~=. & jobst9 
> ~=. 
(0 real changes made)

.  
. /*Tenure categories*/
. gen tencat = tenure 
(137,853 missing values generated)

. recode tencat 1/12=1 13/36=2 37/60 = 3 61/120=4 121/311=5
(tencat: 123537 changes made)

. recode tencat .=1
(tencat: 137853 changes made)

. *Employment status
. gen type = 0

. replace type = type1 if jobstst2 == 1 & jobst1 <= length & length <= joben1
(61,580 real changes made, 256 to missing)

. replace type = type2 if jobstst2 == 1 & jobst2 < length & length <= joben2
(33,280 real changes made, 82 to missing)

. replace type = type3 if jobstst2 == 1 & jobst3 < length & length <= joben3
(19,062 real changes made, 184 to missing)

. replace type = type4 if jobstst2 == 1 & jobst4 < length & length <= joben4
(7,617 real changes made, 29 to missing)

. replace type = type5 if jobstst2 == 1 & jobst5 < length & length <= joben5
(3,665 real changes made)

. replace type = type6 if jobstst2 == 1 & jobst6 < length & length <= joben6
(841 real changes made)

. replace type = type7 if jobstst2 == 1 & jobst7 < length & length <= joben7
(198 real changes made)

. replace type = type8 if jobstst2 == 1 & jobst8 < length & length <= joben8
(31 real changes made)

. replace type = type9 if jobstst2 == 1 & jobst9 < length & length <= joben9 
(0 real changes made)

. *Occupation
. gen jobssm = 0

. replace jobssm = jobssm1 if jobstst2 == 1 & jobst1 <= length & length <= joben1
(61,580 real changes made, 399 to missing)

. replace jobssm = jobssm2 if jobstst2 == 1 & jobst2 < length & length <= joben2
(33,250 real changes made, 291 to missing)

. replace jobssm = jobssm3 if jobstst2 == 1 & jobst3 < length & length <= joben3
(19,061 real changes made, 177 to missing)

. replace jobssm = jobssm4 if jobstst2 == 1 & jobst4 < length & length <= joben4
(7,568 real changes made, 34 to missing)

. replace jobssm = jobssm5 if jobstst2 == 1 & jobst5 < length & length <= joben5
(3,706 real changes made)

. replace jobssm = jobssm6 if jobstst2 == 1 & jobst6 < length & length <= joben6
(851 real changes made)

. replace jobssm = jobssm7 if jobstst2 == 1 & jobst7 < length & length <= joben7
(198 real changes made)

. replace jobssm = jobssm8 if jobstst2 == 1 & jobst8 < length & length <= joben8
(31 real changes made)

. replace jobssm = jobssm9 if jobstst2 == 1 & jobst9 < length & length <= joben9 
(0 real changes made)

. 
. recode type (1/2=1) (3/5=2) (6/7=3) (0=4)
(type: 261572 changes made)

. 
end of do-file

. 
. *Leaving home dummy
. gen pld = .
(263,886 missing values generated)

. *Never
. replace pld =0 if plv01jh == 2 & plv01ong == 2
(11,193 real changes made)

. *From JHS graduation to one point
. replace pld =0 if plv01jh == 2 & plv01ong == 1 & length <= pleny1 & pleny1~=.
(84,613 real changes made)

. replace pld =1 if pleny1 < length & pleny1 ~=.
(155,860 real changes made)

. *Left before JHS graduation
. replace pld =1 if plv01jh == 1 & length < plsty1 & plsty1 ~=.
(1,128 real changes made)

. *Live with parents since then
. replace pld =0 if plv01jh == 1 & plv01ong == 2 & plsty1 <= length & plsty1 ~=.
(267 real changes made)

. *Live with parents until some point
. replace pld =0 if plv01jh == 1 & plsty1 <= length & length <= pleny1 & plsty1 ~=. & pleny1 ~=.
(1,198 real changes made)

. *Left home then
. replace pld =1 if plv01jh == 1 & length < pleny1 & pleny1~=.
(1,574 real changes made)

. *Living with parents to the present (2nd time)
. replace pld =0 if plsty2 <= length & plv02ong == 2 & plsty2~=.
(4,583 real changes made)

. *Living with parents until some point (2nd time)
. replace pld =0 if plsty2 <= length & length <= pleny2 & plsty2 ~=. & pleny2 ~=.
(4,549 real changes made)

. *Left at home then
. replace pld =1 if length < pleny2  & pleny2 ~=.
(16,422 real changes made)

. *Living with parents to the present (3rd time)
. replace pld =0 if plsty3 <= length & plv03ong == 2 & plsty3~=.
(645 real changes made)

. *Living with parents until some point (3rd time)
. replace pld =0 if plsty3 <= length & length <= pleny3 & plsty3 ~=. & pleny3 ~=.
(86 real changes made)

. *Left home then
. replace pld =1 if length < pleny3  & pleny3 ~=.
(755 real changes made)

. *Living with parents to the present (4th time)
. replace pld =0 if plsty4 <= length & plv04ong == 2 & plsty4~=.
(0 real changes made)

. *Living with parents to the present (4th time)
. replace pld =0 if plsty4 <= length & length <= pleny4 & plsty4 ~=. & pleny4 ~=.
(0 real changes made)

. *Left home then
. replace pld =1 if length < pleny4  & pleny4 ~=.
(0 real changes made)

. 
. *Occupation 12, 18, or 24 months ago）
. bysort iduse: gen jobssm1a = jobssm[_n-12] if iduse==iduse[_n-12]
(13,052 missing values generated)

. bysort iduse: gen type1a = type[_n-12] if iduse==iduse[_n-12]
(12,704 missing values generated)

. bysort iduse: gen jobssm2a = jobssm[_n-24] if iduse==iduse[_n-24]
(25,245 missing values generated)

. bysort iduse: gen type2a = type[_n-24] if iduse==iduse[_n-24]
(24,897 missing values generated)

. bysort iduse: gen jobssm15a = jobssm[_n-18] if iduse==iduse[_n-18]
(19,149 missing values generated)

. bysort iduse: gen pld15a = pld[_n-18] if iduse==iduse[_n-18]
(27,171 missing values generated)

. bysort iduse: gen type15a = type[_n-18] if iduse==iduse[_n-18]
(18,801 missing values generated)

. recode type1a type2a type15a (.=4)
(type1a: 12704 changes made)
(type2a: 24897 changes made)
(type15a: 18801 changes made)

. recode jobssm1a jobssm2a jobssm15a (0=5)
(jobssm1a: 132511 changes made)
(jobssm2a: 126895 changes made)
(jobssm15a: 129728 changes made)

. recode jobssm1a  (.=5) if type1a == 4
(jobssm1a: 12484 changes made)

. recode jobssm2a  (.=5) if type2a == 4
(jobssm2a: 24689 changes made)

. recode jobssm15a (.=5) if type15a == 4
(jobssm15a: 18587 changes made)

. 
. *time varying marital status
. gen mrgstst = 0

. recode mrgstst 0=1 if mrgst1 <= length & length <= mrgen1 
(mrgstst: 129147 changes made)

. recode mrgstst 0=1 if mrgst2 <= length & length <= mrgen2
(mrgstst: 1457 changes made)

. 
. *Year of child birth
. gen bch=bch1 if cbirth1 == length
(262,868 missing values generated)

. replace bch=bch2 if cbirth2 == length
(726 real changes made)

. replace bch=bch3 if cbirth3 == length
(226 real changes made)

. 
. *1"Upper non-manual"2"Lower non-manual"3"Upper manual"4"Lower manual"5"Non-employed"
. recode type1 (1/2=1) (3/5=2) (6/7=3) (0=4)
(type1: 261096 changes made)

. 
. *Risk at month starting from 12+1 months after the first birth
. gen lmonth = length - cbirth1 - 12 + 1

. *Omitting person-month before 12 months after the first birth (36 cases are omitted from the sample)
. drop if length < cbirth1+12
(159,041 observations deleted)

. ///////////////////////////////////////////////////
> *creating event dummy using bev and length
. forvalues i=1/3{
  2. gen bev`i'=0
  3. recode bev`i' 0=1 if cbirth`i'==length
  4. }
(bev1: 0 changes made)
(bev2: 725 changes made)
(bev3: 241 changes made)

. 
. *Time varing divorce dummy
. gen div=0

. replace div=1 if mrgen1 < length & mrgen1 ~=.
(6,568 real changes made)

. replace div=0 if length < mrgst2 & mrgst2 ~=.
(1,171 real changes made)

. replace div=1 if mrgen2 < length & mrgen2 ~=.
(0 real changes made)

. 
. recode bripreg 0=1 1=2, gen(bripregx)
(104845 differences between bripreg and bripregx)

. 
. 
end of do-file

. *Labeling variables/values
. do "/Users/fumiyau/Documents/GitHub/OrderMatters/4.Labeling.do"

. /*Labeling*/
. label values type typel

. label variable type   "Job status (ref: Standard)"

. label variable bripreg   "Premarital pregnancy"

. label variable bripreg7   "Premarital pregnancy"

. label variable bripreg9   "Premarital pregnancy"

. label values bripreg bripregl

. label define edul 0"Educational attainment (ref: high school)"1"Junior high school"2"High school"3"Jun
> ior/two year colleges"4"University and more"6"Unknown"  , replace

. label define eduls 0"Spouse's Educational attainment (ref: high school)"1"Junior high school"2"High sc
> hool"3"Junior/two year colleges"4"University and more"6"Unknown"  , replace

. label define cohortl 0"Birth cohort (ref: 1966-1970)"1"1966-1970" 2"1971-1975" 3"1976-1980",replace

. label define marcatl 0"Age at first marriage (ref: 29-31)"1"16-22"2"23-25"3"26-28"4"29-31"5"32-34"6"> 
> 35",replace

. label define birthcatl1 0"Age at first birth (ref: 29-31)"1"16-22"2"23-25"3"26-28"4"29-31"5"32-34"6"> 
> 35",replace

. label define birthcatl2 0"Age at second birth (ref: 29-31)"1"16-22"2"23-25"3"26-28"4"29-31"5"32-34"6">
>  35",replace

. label define birthcatl3 0"Age at third birth (ref: 29-31)"1"16-22"2"23-25"3"26-28"4"29-31"5"32-34"6"> 
> 35",replace

. label define marcohortl 0"Year at marriage" 1"1985-1994" 2"1995-1999" 3"2000-2004" 4"2005-2009"

. label define typel 0"Employment status at first job (ref: Standard)"1"Standard"2"Non-standard"3"Self-e
> mployed"4"Non-employed",replace

. label define jobl 0"Occupation at first job (ref: Upper non-manual)"1"Upper non-manual"2"Lower non-man
> ual"3"Upper manual"4"Lower manual"5"Non-employed",replace

. label define typel15 0"Employment status 18 months ago (ref: Standard)"1"Standard"2"Non-standard"3"Sel
> f-employed"4"Non-employed",replace

. label define jobl15 0"Occupation  18 months ago (ref: Upper non-manual)"1"Upper non-manual"2"Lower non
> -manual"3"Upper manual"4"Lower manual"5"Non-employed",replace

. 
. label values redu edul

. label values spedu eduls

. label values cohort cohortl

. label values marcat marcatl

. label values type1 typel

. label values jobssm1 jobl

. label values type15a typel15

. label values jobssm15a jobl15

. label values birthcat1 birthcatl1

. label values birthcat2 birthcatl2

. label values birthcat3 birthcatl3

. label values marcohort marcohortl

. label variable div   "Divorced"

. label variable redu   "Respondent's educatinal attainment (ref: junior high)"

. label variable spedu   "Spouse's educatinal attainment (ref: junior high)"

. label variable cohort   "Birth cohort (ref: 1966-1970)"

. label variable marcat   "Age at marriage (ref: 29-31)"

. label variable lmonth   "Month at risk"

. label variable birthage1   "Age at first birth"

. label variable birthage2   "Age at second birth"

. label variable pld15a   "Leaving parental home"

. 
end of do-file

. *Analysis
. do "/Users/fumiyau/Documents/GitHub/OrderMatters/5.Descriptive.do"

. *Drop person-year after the second birth
. keep iduse pld15a ccnumttl bev2 bev3 ccnum2 ccnum1 cbirth1 cbirth2 cbirth3 birthcat1 birthcat2 birthca
> t3 length bripreg bripreg7 bripreg9 redu spedu cohort marcat marcohort marage type1 type1a type15a typ
> e2a jobssm1 jobssm1a jobssm15a jobssm2a lmonth div birthage1 birthage2

. mark nomiss

. markout nomiss type15a jobssm15a lmonth pld15a 

. drop if nomiss == 0
(4,696 observations deleted)

. *drop if length < cbirth1+12 is already done
. drop if cbirth2 < length & ccnum2==1 & cbirth2 ~=.
(64,079 observations deleted)

. 
. *generate months categories
. recode lmonth 1/12=1 13/24=2 25/36=3 37/60=4 61/96=5 97/258=6, gen(lmonthcat)
(35127 differences between lmonth and lmonthcat)

. recode lmonth 1/6=0 7/12=1 13/24=2 25/36=3 37/60=4 61/96=5 97/258=6, gen(lmonthcat2)
(36070 differences between lmonth and lmonthcat2)

. recode lmonth 1/12=1 13/18=2 19/24=3 25/36=4 37/60=5 61/96=6 97/258=7, gen(lmonthcat3)
(35127 differences between lmonth and lmonthcat3)

. recode lmonth 1/6=0 7/12=1 13/24=2 25/36=3 37/48=4 49/60=5 61/84=6 85/258=7, gen(lmonthcat4)
(36070 differences between lmonth and lmonthcat4)

. 
. *output descriptive stats when lmonth=1 and bripreg = 7
. cd "/Users/fumiyau/Documents/GitHub/OrderMatters/Results/Descriptive"
/Users/fumiyau/Documents/GitHub/OrderMatters/Results/Descriptive

. quietly estpost tabulate redu bripreg7 if lmonth == 1, nototal

. quietly esttab . using desc1.csv, replace cell(colpct(fmt(2))) unstack noobs

. quietly estpost tabulate spedu bripreg7 if lmonth == 1, nototal

. quietly esttab . using desc2.csv, replace cell(colpct(fmt(2))) unstack noobs

. quietly estpost tabulate marcohort bripreg7 if lmonth == 1, nototal

. quietly esttab . using desc3.csv, replace cell(colpct(fmt(2))) unstack noobs

. quietly estpost tabulate marcat bripreg7 if lmonth == 1, nototal

. quietly esttab . using desc4.csv, replace cell(colpct(fmt(2))) unstack noobs

. quietly estpost tabulate type15a bripreg7 if lmonth == 1, nototal

. quietly esttab . using desc5.csv, replace cell(colpct(fmt(2))) unstack noobs

. quietly estpost tabulate jobssm15a bripreg7 if lmonth == 1, nototal

. quietly esttab . using desc6.csv, replace cell(colpct(fmt(2))) unstack noobs

. *quietly estpost tabulate cohort bripreg7 if lmonth == 1, nototal
. *quietly esttab . using desc7.csv, replace cell(colpct(fmt(2))) unstack noobs
. quietly estpost tabulate pld bripreg7 if lmonth == 1, nototal

. quietly esttab . using desc8.csv, replace cell(colpct(fmt(2))) unstack noobs

. *tabulate
. for varlist bripreg7 redu spedu marcohort marcat type15a jobssm15a pld15a: tab X bripreg7 if lmonth ==
>  1, chi

->  tab bripreg7 bripreg7 if lmonth == 1, chi

Premarital | Premarital pregnancy
 pregnancy |         0          1 |     Total
-----------+----------------------+----------
         0 |       706          0 |       706 
         1 |         0        237 |       237 
-----------+----------------------+----------
     Total |       706        237 |       943 

          Pearson chi2(1) = 943.0000   Pr = 0.000

->  tab redu bripreg7 if lmonth == 1, chi

         Respondent's |
educatinal attainment | Premarital pregnancy
   (ref: junior high) |         0          1 |     Total
----------------------+----------------------+----------
   Junior high school |         7          4 |        11 
          High school |       258        125 |       383 
Junior/two year colle |       309         92 |       401 
  University and more |       132         16 |       148 
----------------------+----------------------+----------
                Total |       706        237 |       943 

          Pearson chi2(3) =  29.3562   Pr = 0.000

->  tab spedu bripreg7 if lmonth == 1, chi

  Spouse's educatinal |
     attainment (ref: | Premarital pregnancy
         junior high) |         0          1 |     Total
----------------------+----------------------+----------
   Junior high school |        17         12 |        29 
          High school |       228        113 |       341 
Junior/two year colle |       117         40 |       157 
  University and more |       308         42 |       350 
              Unknown |        36         30 |        66 
----------------------+----------------------+----------
                Total |       706        237 |       943 

          Pearson chi2(4) =  62.2581   Pr = 0.000

->  tab marcohort bripreg7 if lmonth == 1, chi

       RECODE of | Premarital pregnancy
         maryear |         0          1 |     Total
-----------------+----------------------+----------
       1985-1994 |       213         73 |       286 
       1995-1999 |       257         69 |       326 
       2000-2004 |       198         75 |       273 
       2005-2009 |        38         20 |        58 
-----------------+----------------------+----------
           Total |       706        237 |       943 

          Pearson chi2(3) =   6.2391   Pr = 0.101

->  tab marcat bripreg7 if lmonth == 1, chi

Age at marriage (ref: | Premarital pregnancy
               29-31) |         0          1 |     Total
----------------------+----------------------+----------
                16-22 |        94         63 |       157 
                23-25 |       227         68 |       295 
                26-28 |       246         58 |       304 
                29-31 |        98         35 |       133 
                32-34 |        27          8 |        35 
                 > 35 |        14          5 |        19 
----------------------+----------------------+----------
                Total |       706        237 |       943 

          Pearson chi2(5) =  25.5704   Pr = 0.000

->  tab type15a bripreg7 if lmonth == 1, chi

                      | Premarital pregnancy
              type15a |         0          1 |     Total
----------------------+----------------------+----------
             Standard |       233        116 |       349 
         Non-standard |        84         31 |       115 
        Self-employed |        18          4 |        22 
         Non-employed |       371         86 |       457 
----------------------+----------------------+----------
                Total |       706        237 |       943 

          Pearson chi2(3) =  22.6366   Pr = 0.000

->  tab jobssm15a bripreg7 if lmonth == 1, chi

                      | Premarital pregnancy
            jobssm15a |         0          1 |     Total
----------------------+----------------------+----------
     Upper non-manual |       100         28 |       128 
     Lower non-manual |       145         52 |       197 
         Upper manual |        44         40 |        84 
         Lower manual |        46         31 |        77 
         Non-employed |       371         86 |       457 
----------------------+----------------------+----------
                Total |       706        237 |       943 

          Pearson chi2(4) =  42.5097   Pr = 0.000

->  tab pld15a bripreg7 if lmonth == 1, chi

   Leaving |
  parental | Premarital pregnancy
      home |         0          1 |     Total
-----------+----------------------+----------
         0 |        33         43 |        76 
         1 |       673        194 |       867 
-----------+----------------------+----------
     Total |       706        237 |       943 

          Pearson chi2(1) =  43.4428   Pr = 0.000

. *descriptive stats
. for varlist bripreg7 lmonthcat4 redu spedu marcohort marcat type15a jobssm15a pld15a div birthcat1: ta
> bulate X, generate (Xdummy) 

->  tabulate bripreg7, generate (bripreg7dummy)

 Premarital |
  pregnancy |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,257       75.57       75.57
          1 |      8,813       24.43      100.00
------------+-----------------------------------
      Total |     36,070      100.00

->  tabulate lmonthcat4, generate (lmonthcat4dummy)

  RECODE of |
     lmonth |
  (Month at |
      risk) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,554       15.40       15.40
          1 |      4,983       13.81       29.21
          2 |      7,215       20.00       49.22
          3 |      4,618       12.80       62.02
          4 |      3,161        8.76       70.78
          5 |      2,334        6.47       77.25
          6 |      3,235        8.97       86.22
          7 |      4,970       13.78      100.00
------------+-----------------------------------
      Total |     36,070      100.00

->  tabulate redu, generate (redudummy)

     Respondent's educatinal attainment |
                     (ref: junior high) |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                     Junior high school |        659        1.83        1.83
                            High school |     15,912       44.11       45.94
               Junior/two year colleges |     14,484       40.16       86.10
                    University and more |      5,015       13.90      100.00
----------------------------------------+-----------------------------------
                                  Total |     36,070      100.00

->  tabulate spedu, generate (spedudummy)

   Spouse's educatinal attainment (ref: |
                           junior high) |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                     Junior high school |      1,179        3.27        3.27
                            High school |     11,880       32.94       36.20
               Junior/two year colleges |      5,595       15.51       51.72
                    University and more |     12,972       35.96       87.68
                                Unknown |      4,444       12.32      100.00
----------------------------------------+-----------------------------------
                                  Total |     36,070      100.00

->  tabulate marcohort, generate (marcohortdummy)

       RECODE of |
         maryear |      Freq.     Percent        Cum.
-----------------+-----------------------------------
       1985-1994 |     13,281       36.82       36.82
       1995-1999 |     13,433       37.24       74.06
       2000-2004 |      8,538       23.67       97.73
       2005-2009 |        818        2.27      100.00
-----------------+-----------------------------------
           Total |     36,070      100.00

->  tabulate marcat, generate (marcatdummy)

      Age at marriage (ref: 29-31) |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                             16-22 |      7,033       19.50       19.50
                             23-25 |     12,489       34.62       54.12
                             26-28 |     10,505       29.12       83.25
                             29-31 |      4,695       13.02       96.26
                             32-34 |        826        2.29       98.55
                              > 35 |        522        1.45      100.00
-----------------------------------+-----------------------------------
                             Total |     36,070      100.00

->  tabulate type15a, generate (type15adummy)

                                type15a |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                               Standard |      8,133       22.55       22.55
                           Non-standard |      5,940       16.47       39.02
                          Self-employed |      1,021        2.83       41.85
                           Non-employed |     20,976       58.15      100.00
----------------------------------------+-----------------------------------
                                  Total |     36,070      100.00

->  tabulate jobssm15a, generate (jobssm15adummy)

                              jobssm15a |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                       Upper non-manual |      3,640       10.09       10.09
                       Lower non-manual |      5,363       14.87       24.96
                           Upper manual |      2,711        7.52       32.48
                           Lower manual |      3,380        9.37       41.85
                           Non-employed |     20,976       58.15      100.00
----------------------------------------+-----------------------------------
                                  Total |     36,070      100.00

->  tabulate pld15a, generate (pld15adummy)

    Leaving |
   parental |
       home |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,428        6.73        6.73
          1 |     33,642       93.27      100.00
------------+-----------------------------------
      Total |     36,070      100.00

->  tabulate div, generate (divdummy)

   Divorced |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,857       93.86       93.86
          1 |      2,213        6.14      100.00
------------+-----------------------------------
      Total |     36,070      100.00

->  tabulate birthcat1, generate (birthcat1dummy)

            RECODE of birthage1 |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                          16-22 |      4,608       12.78       12.78
                          23-25 |      7,890       21.87       34.65
                          26-28 |     11,456       31.76       66.41
                          29-31 |      8,623       23.91       90.32
                          32-34 |      2,543        7.05       97.37
                           > 35 |        950        2.63      100.00
--------------------------------+-----------------------------------
                          Total |     36,070      100.00

. quietly estpost tabstat bripreg7dummy1 bripreg7dummy2 lmonthcat4dummy1 lmonthcat4dummy2 lmonthcat4dumm
> y3 lmonthcat4dummy4 lmonthcat4dummy5 lmonthcat4dummy6 lmonthcat4dummy7 lmonthcat4dummy8 redudummy1 red
> udummy2 redudummy3 redudummy4 spedudummy1 spedudummy2 spedudummy3 spedudummy4 spedudummy5 marcohortdum
> my1 marcohortdummy2 marcohortdummy3 marcohortdummy4 marcatdummy1 marcatdummy2 marcatdummy3 marcatdummy
> 4 marcatdummy5 marcatdummy6 marcohortdummy1 marcohortdummy2 marcohortdummy3 marcohortdummy4 type15adum
> my1 type15adummy2 type15adummy3 type15adummy4 jobssm15adummy1 jobssm15adummy2 jobssm15adummy3 jobssm15
> adummy4 jobssm15adummy5 pld15adummy1 pld15adummy2 divdummy1 divdummy2 birthcat1dummy1 birthcat1dummy2 
> birthcat1dummy3 birthcat1dummy4 birthcat1dummy5 birthcat1dummy6, statistics(mean sd min max) columns(s
> tatistics) 

. quietly esttab . using desc.csv, replace main(mean) aux(sd) wide nostar unstack noobs nonote label

. *Recode for regression
. recode marcat birthcat1 birthcat2 (4=0)
(marcat: 4695 changes made)
(birthcat1: 8623 changes made)
(birthcat2: 5239 changes made)

. recode jobssm* type* (1=0)
(jobssm1: 7320 changes made)
(jobssm1a: 3608 changes made)
(jobssm2a: 3806 changes made)
(jobssm15a: 3640 changes made)
(jobssm15adummy1: 3640 changes made)
(jobssm15adummy2: 5363 changes made)
(jobssm15adummy3: 2711 changes made)
(jobssm15adummy4: 3380 changes made)
(jobssm15adummy5: 20976 changes made)
(type1: 29632 changes made)
(type1a: 7540 changes made)
(type2a: 9230 changes made)
(type15a: 8133 changes made)
(type15adummy1: 8133 changes made)
(type15adummy2: 5940 changes made)
(type15adummy3: 1021 changes made)
(type15adummy4: 20976 changes made)

. recode redu spedu (2=0)
(redu: 15912 changes made)
(spedu: 11880 changes made)

. recode marcohort 3=0
(marcohort: 8538 changes made)

. 
. 
end of do-file

. do "/Users/fumiyau/Documents/GitHub/OrderMatters/6.PSMatching.do"

. *Do files for data analysis is prepared according to the definition of bridal pregnancy
. *Propensity score matching
. 
. *Output the results of logit models
. qui logit bripreg7 i.redu i.spedu i.marcohort i.marcat i.type15a i.jobssm15a i.pld15a if lmonth==1

. est sto logit

. cd "/Users/fumiyau/Documents/GitHub/OrderMatters/Results/PrppensityScore"
/Users/fumiyau/Documents/GitHub/OrderMatters/Results/PrppensityScore

. esttab logit using logitbeforemathching7.csv, wide se scalar(N chi2 df_m ll aic r2_p) star(# 0.1 * 0.0
> 5 ** 0.01 *** 0.001) b(3)  replace label  noomitted title(Determinants of second childbirth (left: adj
> usted right: observed))
(output written to logitbeforemathching7.csv)

. 
. *Propensity score matching
. *Nearest neibor within caliper 0.1, 1-1 match
. set seed 1000

. generate x=uniform()

. sort x

. psmatch2 bripreg7 i.redu i.spedu i.marcohort i.marcat i.type15a i.jobssm15a i.pld15a if lmonth==1 , lo
> git caliper(0.1) noreplacement descending
note: 5.jobssm15a omitted because of collinearity

Logistic regression                             Number of obs     =        943
                                                LR chi2(22)       =     153.24
                                                Prob > chi2       =     0.0000
Log likelihood = -455.03286                     Pseudo R2         =     0.1441

-------------------------------------------------------------------------------------------
                 bripreg7 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
                     redu |
      Junior high school  |   .0040008   .6935842     0.01   0.995    -1.355399    1.363401
Junior/two year colleges  |  -.2041454    .193741    -1.05   0.292    -.5838708    .1755801
     University and more  |  -.6463833   .3392201    -1.91   0.057    -1.311242    .0184759
                          |
                    spedu |
      Junior high school  |   .5174104   .4181935     1.24   0.216    -.3022338    1.337054
Junior/two year colleges  |  -.1818748   .2382949    -0.76   0.445    -.6489242    .2851746
     University and more  |  -.9063484   .2314334    -3.92   0.000     -1.35995   -.4527472
                 Unknown  |   .4213329   .2971267     1.42   0.156    -.1610248    1.003691
                          |
                marcohort |
               1985-1994  |  -.7319319   .2492229    -2.94   0.003      -1.2204    -.243464
               1995-1999  |   -.752983   .2209654    -3.41   0.001    -1.186067   -.3198988
               2005-2009  |   .4666855   .3506143     1.33   0.183     -.220506    1.153877
                          |
                   marcat |
                   16-22  |   .6697778   .3294252     2.03   0.042     .0241163    1.315439
                   23-25  |   .0786685   .2887595     0.27   0.785    -.4872897    .6446268
                   26-28  |  -.2640962   .2764271    -0.96   0.339    -.8058834     .277691
                   32-34  |  -.3615545   .4996374    -0.72   0.469    -1.340826    .6177169
                    > 35  |  -.4172344   .5955806    -0.70   0.484    -1.584551    .7500822
                          |
                  type15a |
            Non-standard  |  -.5514311   .2713627    -2.03   0.042    -1.083292     -.01957
           Self-employed  |  -1.146885   .6021649    -1.90   0.057    -2.327106    .0333368
            Non-employed  |   -.573748   .2774364    -2.07   0.039    -1.117513   -.0299827
                          |
                jobssm15a |
        Lower non-manual  |   .1723687   .2974826     0.58   0.562    -.4106865    .7554239
            Upper manual  |   .9345292   .3492409     2.68   0.007     .2500296    1.619029
            Lower manual  |   .2501662   .3602377     0.69   0.487    -.4558867    .9562191
            Non-employed  |          0  (omitted)
                          |
                 1.pld15a |  -1.266071   .2711613    -4.67   0.000    -1.797537   -.7346045
                    _cons |    1.02147    .438485     2.33   0.020     .1620556    1.880885
-------------------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.

. pstest,both

----------------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test    |  V(T)/
Variable          Matched | Treated Control    %bias  |bias| |    t    p>|t| |  V(C)
--------------------------+----------------------------------+---------------+----------
1.redu                 U  | .01688   .00992      6.0         |   0.86  0.388 |     .
                       M  | .01794   .01794      0.0   100.0 |  -0.00  1.000 |     .
                          |                                  |               |
3.redu                 U  | .38819   .43768    -10.1         |  -1.33  0.183 |     .
                       M  | .39462   .38565      1.8    81.9 |   0.19  0.846 |     .
                          |                                  |               |
4.redu                 U  | .06751   .18697    -36.4         |  -4.41  0.000 |     .
                       M  | .07175    .0583      4.1    88.7 |   0.58  0.566 |     .
                          |                                  |               |
1.spedu                U  | .05063   .02408     14.0         |   2.05  0.041 |     .
                       M  | .05381   .05381      0.0   100.0 |  -0.00  1.000 |     .
                          |                                  |               |
3.spedu                U  | .16878   .16572      0.8         |   0.11  0.913 |     .
                       M  | .17937   .16592      3.6  -340.5 |   0.38  0.708 |     .
                          |                                  |               |
4.spedu                U  | .17722   .43626    -58.5         |  -7.34  0.000 |     .
                       M  | .18834   .19283     -1.0    98.3 |  -0.12  0.904 |     .
                          |                                  |               |
6.spedu                U  | .12658   .05099     26.8         |   3.98  0.000 |     .
                       M  | .11659   .08969      9.5    64.4 |   0.93  0.351 |     .
                          |                                  |               |
1.marcohort            U  | .30802    .3017      1.4         |   0.18  0.855 |     .
                       M  | .30045   .33632     -7.8  -467.9 |  -0.81  0.417 |     .
                          |                                  |               |
2.marcohort            U  | .29114   .36402    -15.6         |  -2.04  0.041 |     .
                       M  | .29596   .29596      0.0   100.0 |   0.00  1.000 |     .
                          |                                  |               |
4.marcohort            U  | .08439   .05382     12.1         |   1.70  0.090 |     .
                       M  | .08969   .06726      8.8    26.6 |   0.88  0.380 |     .
                          |                                  |               |
1.marcat               U  | .26582   .13314     33.6         |   4.80  0.000 |     .
                       M  | .25112     .287     -9.1    73.0 |  -0.85  0.394 |     .
                          |                                  |               |
2.marcat               U  | .28692   .32153     -7.5         |  -0.99  0.321 |     .
                       M  | .29148   .30942     -3.9    48.2 |  -0.41  0.680 |     .
                          |                                  |               |
3.marcat               U  | .24473   .34844    -22.8         |  -2.97  0.003 |     .
                       M  | .26009   .21973      8.9    61.1 |   1.00  0.319 |     .
                          |                                  |               |
5.marcat               U  | .03376   .03824     -2.4         |  -0.32  0.752 |     .
                       M  | .03587   .03587      0.0   100.0 |  -0.00  1.000 |     .
                          |                                  |               |
6.marcat               U  |  .0211   .01983      0.9         |   0.12  0.905 |     .
                       M  | .02242   .01345      6.3  -607.9 |   0.71  0.477 |     .
                          |                                  |               |
2.type15a              U  |  .1308   .11898      3.6         |   0.48  0.631 |     .
                       M  | .13901   .13901      0.0   100.0 |  -0.00  1.000 |     .
                          |                                  |               |
3.type15a              U  | .01688    .0255     -6.0         |  -0.76  0.447 |     .
                       M  | .01794   .00897      6.2    -4.1 |   0.82  0.412 |     .
                          |                                  |               |
4.type15a              U  | .36287    .5255    -33.1         |  -4.37  0.000 |     .
                       M  | .38565   .38117      0.9    97.2 |   0.10  0.923 |     .
                          |                                  |               |
2.jobssm15a            U  | .21941   .20538      3.4         |   0.46  0.646 |     .
                       M  | .21973   .24664     -6.6   -91.8 |  -0.67  0.503 |     .
                          |                                  |               |
3.jobssm15a            U  | .16878   .06232     33.7         |   5.04  0.000 |     .
                       M  | .15247   .12108      9.9    70.5 |   0.96  0.336 |     .
                          |                                  |               |
4.jobssm15a            U  |  .1308   .06516     22.2         |   3.21  0.001 |     .
                       M  | .11659   .11659      0.0   100.0 |   0.00  1.000 |     .
                          |                                  |               |
5.jobssm15a            U  | .36287    .5255    -33.1         |  -4.37  0.000 |     .
                       M  | .38565   .38117      0.9    97.2 |   0.10  0.923 |     .
                          |                                  |               |
1.pld15a               U  | .81857   .95326    -43.3         |  -6.74  0.000 |     .
                       M  | .83857   .89686    -18.7    56.7 |  -1.82  0.069 |     .
                          |                                  |               |
----------------------------------------------------------------------------------------
* if variance ratio outside [0.77; 1.29] for U and [0.77; 1.30] for M

-----------------------------------------------------------------------------------
 Sample    | Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
-----------+-----------------------------------------------------------------------
 Unmatched | 0.143    152.45    0.000     18.6      14.0      96.2*   1.27      .
 Matched   | 0.016     10.02    0.986      4.7       3.9      30.0*   1.44      .
-----------------------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]

. sort _id 

. gen match=iduse[_n1]
(35,847 missing values generated)

. gen treat=iduse if _nn==1
(35,847 missing values generated)

. list id match treat if treat ~=.

       +-----------------------+
       | iduse   match   treat |
       |-----------------------|
  707. |  2110    1391    2110 |
  708. |   282      35     282 |
  709. |  2713    1502    2713 |
  710. |  2311     738    2311 |
  713. |  1390     953    1390 |
       |-----------------------|
  714. |  2570      92    2570 |
  715. |    57     753      57 |
  717. |  1587      22    1587 |
  719. |    71     184      71 |
  721. |   585     825     585 |
       |-----------------------|
  723. |  2166    1506    2166 |
  724. |  2255    1270    2255 |
  725. |  2473    2540    2473 |
  726. |   487    2527     487 |
  727. |  1043    2167    1043 |
       |-----------------------|
  728. |   855    2525     855 |
  729. |   751    1364     751 |
  730. |  2023    1518    2023 |
  731. |  2252    1737    2252 |
  732. |  1238    2662    1238 |
       |-----------------------|
  733. |  2528    1318    2528 |
  734. |   907    2475     907 |
  736. |   201    1561     201 |
  737. |  1199    2198    1199 |
  744. |   993    2297     993 |
       |-----------------------|
  745. |   923    1585     923 |
  746. |  1595     910    1595 |
  747. |   831    2622     831 |
  748. |  1623    2160    1623 |
  750. |   143    2484     143 |
       |-----------------------|
  751. |  2043     133    2043 |
  752. |  1635     619    1635 |
  753. |   314     811     314 |
  754. |   644    1683     644 |
  755. |  1864    1096    1864 |
       |-----------------------|
  756. |  1594    2031    1594 |
  757. |  1423       7    1423 |
  758. |   374    1533     374 |
  759. |  2000    2092    2000 |
  760. |  2631     208    2631 |
       |-----------------------|
  761. |   699    1568     699 |
  762. |  1759    2658    1759 |
  763. |  1223    1356    1223 |
  764. |   516     447     516 |
  765. |  2021    2298    2021 |
       |-----------------------|
  766. |  1901     511    1901 |
  767. |  2179    1388    2179 |
  768. |  1877    1018    1877 |
  769. |  2039     934    2039 |
  770. |  2290    2562    2290 |
       |-----------------------|
  771. |   408    2001     408 |
  772. |  2186    1697    2186 |
  773. |  1472    1578    1472 |
  774. |  1487    1633    1487 |
  775. |   229     796     229 |
       |-----------------------|
  776. |   316     127     316 |
  777. |  2171    1214    2171 |
  778. |   152     291     152 |
  779. |   427    2711     427 |
  780. |  1504     770    1504 |
       |-----------------------|
  781. |   890     904     890 |
  782. |    37     842      37 |
  783. |  2078    2487    2078 |
  784. |  1060    1298    1060 |
  785. |   728    2327     728 |
       |-----------------------|
  786. |  2585    2055    2585 |
  787. |  1819      19    1819 |
  788. |  1973    2552    1973 |
  789. |  1982     877    1982 |
  790. |  2444    2507    2444 |
       |-----------------------|
  791. |   193    1717     193 |
  792. |  2339    1632    2339 |
  793. |  1208     841    1208 |
  794. |   442    2208     442 |
  795. |   838    2441     838 |
       |-----------------------|
  796. |  2300    1953    2300 |
  797. |   807    1541     807 |
  798. |  1432    1964    1432 |
  799. |  2381     742    2381 |
  800. |  1731     792    1731 |
       |-----------------------|
  801. |  2389    2154    2389 |
  802. |  1949    1952    1949 |
  803. |   311    2128     311 |
  804. |  2629    1361    2629 |
  805. |  2547    2215    2547 |
       |-----------------------|
  806. |  1829    1652    1829 |
  807. |  2417     106    2417 |
  808. |  1412    1204    1412 |
  809. |  1692    1625    1692 |
  810. |  1993    2158    1993 |
       |-----------------------|
  811. |  2308     604    2308 |
  812. |  2253     639    2253 |
  813. |  1606    1957    1606 |
  814. |   125    1467     125 |
  815. |  2072    1687    2072 |
       |-----------------------|
  816. |  1809     571    1809 |
  817. |  1340    2051    1340 |
  818. |   346    2193     346 |
  819. |   625    1853     625 |
  820. |  2313    1618    2313 |
       |-----------------------|
  821. |  1966     449    1966 |
  822. |  1880     270    1880 |
  823. |   535     647     535 |
  824. |   470    2146     470 |
  825. |   983     587     983 |
       |-----------------------|
  826. |  1062    1054    1062 |
  827. |   686    2479     686 |
  828. |  2347    1203    2347 |
  829. |  1600    1529    1600 |
  830. |   128    1892     128 |
       |-----------------------|
  831. |    51     405      51 |
  832. |  2116     257    2116 |
  833. |   388     789     388 |
  834. |   900    1402     900 |
  835. |   361    2651     361 |
       |-----------------------|
  836. |  2184    1986    2184 |
  837. |  1065    1690    1065 |
  838. |  2107     163    2107 |
  839. |  1992    1192    1992 |
  840. |   221     847     221 |
       |-----------------------|
  841. |  1747     296    1747 |
  842. |   973      56     973 |
  843. |   613    1301     613 |
  844. |  1094    1989    1094 |
  845. |  1247     621    1247 |
       |-----------------------|
  846. |  1290     250    1290 |
  847. |  1468    2044    1468 |
  848. |  1194    2398    1194 |
  849. |   962    1605     962 |
  850. |   830     175     830 |
       |-----------------------|
  851. |  1250    1794    1250 |
  852. |   480     745     480 |
  853. |   849    1077     849 |
  854. |  1351    1669    1351 |
  855. |  2236    1044    2236 |
       |-----------------------|
  856. |  1704     321    1704 |
  857. |  2076    1754    2076 |
  858. |   882    2460     882 |
  859. |   854    1490     854 |
  860. |  2316     538    2316 |
       |-----------------------|
  861. |   246    2388     246 |
  862. |   557    1038     557 |
  863. |  1157    2679    1157 |
  864. |  2636    2099    2636 |
  865. |   352    1621     352 |
       |-----------------------|
  866. |  1868    1805    1868 |
  867. |  1124    2454    1124 |
  868. |  1944     124    1944 |
  869. |  1803    2274    1803 |
  870. |   376    2365     376 |
       |-----------------------|
  871. |  2330    1200    2330 |
  872. |  1994     931    1994 |
  873. |   783     652     783 |
  874. |  2106    1727    2106 |
  875. |  1202     140    1202 |
       |-----------------------|
  876. |   626      52     626 |
  877. |    77    1827      77 |
  878. |  1943    2544    1943 |
  879. |   760    2176     760 |
  880. |  2368     211    2368 |
       |-----------------------|
  881. |  1102    2358    1102 |
  882. |  2066     348    2066 |
  883. |  1998    1628    1998 |
  884. |  1814      12    1814 |
  885. |   521     857     521 |
       |-----------------------|
  886. |   424     485     424 |
  887. |  2587    2095    2587 |
  888. |  1352    1610    1352 |
  889. |  2619    2459    2619 |
  890. |  1411    2428    1411 |
       |-----------------------|
  891. |  2558    1530    2558 |
  892. |   224    2026     224 |
  893. |  1582     471    1582 |
  894. |  2725    2225    2725 |
  895. |   418    1846     418 |
       |-----------------------|
  896. |   260     868     260 |
  897. |   155    1146     155 |
  898. |  1558     709    1558 |
  899. |  1804    2511    1804 |
  900. |   120    1404     120 |
       |-----------------------|
  901. |  1245     960    1245 |
  902. |  1962     817    1962 |
  903. |  1399    2105    1399 |
  904. |  2485    2546    2485 |
  905. |   573     823     573 |
       |-----------------------|
  906. |   972    1523     972 |
  907. |  1781     678    1781 |
  908. |   419    2305     419 |
  909. |  1756    1233    1756 |
  910. |  2027    2463    2027 |
       |-----------------------|
  911. |  2279     324    2279 |
  912. |  1971    1231    1971 |
  913. |   330     784     330 |
  914. |  2453    1788    2453 |
  915. |  2309    1006    2309 |
       |-----------------------|
  916. |  1371     441    1371 |
  917. |  2566    1314    2566 |
  918. |   888     192     888 |
  919. |  1483    2702    1483 |
  920. |  2086    2673    2086 |
       |-----------------------|
  921. |   272      79     272 |
  922. |  1744     434    1744 |
  923. |  1244    1826    1244 |
  924. |  1935    2068    1935 |
  925. |  1897     563    1897 |
       |-----------------------|
  926. |  2119    1237    2119 |
  927. |  2312    2693    2312 |
  928. |   588    1942     588 |
  929. |   420    2314     420 |
  930. |  2089    2476    2089 |
       |-----------------------|
  931. |  1387    1449    1387 |
  932. |  2126    2595    2126 |
  933. |  2437    1363    2437 |
  934. |   375    1279     375 |
  935. |  1294    2539    1294 |
       |-----------------------|
  936. |   131     303     131 |
  937. |  1063    2372    1063 |
  938. |   654     948     654 |
  939. |  2660    2694    2660 |
  940. |   119    2510     119 |
       |-----------------------|
  941. |  1715     967    1715 |
  942. |  1452    2138    1452 |
  943. |  2644     188    2644 |
       +-----------------------+

. 
. qui tabout match using desc15a7.csv, replace style(csv)

. gen cont =.   
(36,070 missing values generated)

. qui for num 7 12 19 22 35 52 56 79 92 106 124 127 133 140 163 175 184 188 192 208 211 250 257 270 291 
> 296 303 321 324 348 405 434 441 447 449 471 485 511 538 563 571 587 604 619 621 639 647 652 678 709 73
> 8 742 745 753 770 784 789 792 796 811 817 823 825 841 842 847 857 868 877 904 910 931 934 948 953 960 
> 967 1006 1018 1038 1044 1054 1077 1096 1146 1192 1200 1203 1204 1214 1231 1233 1237 1270 1279 1298 130
> 1 1314 1318 1356 1361 1363 1364 1388 1391 1402 1404 1449 1467 1490 1502 1506 1518 1523 1529 1530 1533 
> 1541 1561 1568 1578 1585 1605 1610 1618 1621 1625 1628 1632 1633 1652 1669 1683 1687 1690 1697 1717 17
> 27 1737 1754 1788 1794 1805 1826 1827 1846 1853 1892 1942 1952 1953 1957 1964 1986 1989 2001 2026 2031
>  2044 2051 2055 2068 2092 2095 2099 2105 2128 2138 2146 2154 2158 2160 2167 2176 2193 2198 2208 2215 2
> 225 2274 2297 2298 2305 2314 2327 2358 2365 2372 2388 2398 2428 2441 2454 2459 2460 2463 2475 2476 247
> 9 2484 2487 2507 2510 2511 2525 2527 2539 2540 2544 2546 2552 2562 2595 2622 2651 2658 2662 2673 2679 
> 2693 2694 2702 2711: replace cont=iduse if iduse==X

. 
. bysort iduse: egen treated = max(treat)
(27748 missing values generated)

. 
. gen group7=.
(36,070 missing values generated)

. *treated 1 controlled 2
. replace group7 = 1 if treated ~=.
(8,322 real changes made)

. replace group7 = 2 if cont ~=.
(8,250 real changes made)

. 
. *Exploring Unmatched cases（group7==.)
. quietly estpost tabstat bripreg7dummy1 bripreg7dummy2 lmonthcat4dummy1 lmonthcat4dummy2 lmonthcat4dumm
> y3 lmonthcat4dummy4 lmonthcat4dummy5 lmonthcat4dummy6 lmonthcat4dummy7 lmonthcat4dummy8 redudummy1 red
> udummy2 redudummy3 redudummy4 spedudummy1 spedudummy2 spedudummy3 spedudummy4 spedudummy5 marcohortdum
> my1 marcohortdummy2 marcohortdummy3 marcohortdummy4 marcatdummy1 marcatdummy2 marcatdummy3 marcatdummy
> 4 marcatdummy5 marcatdummy6 marcohortdummy1 marcohortdummy2 marcohortdummy3 marcohortdummy4 type15adum
> my1 type15adummy2 type15adummy3 type15adummy4 jobssm15adummy1 jobssm15adummy2 jobssm15adummy3 jobssm15
> adummy4 jobssm15adummy5 pld15adummy1 pld15adummy2 divdummy1 divdummy2 birthcat1dummy1 birthcat1dummy2 
> birthcat1dummy3 birthcat1dummy4 birthcat1dummy5 birthcat1dummy6 if group7~=. & lmonth == 1, statistics
> (mean sd min max) columns(statistics) 

. quietly esttab . using descMatched.csv, replace main(mean) aux(sd) wide nostar unstack noobs nonote la
> bel

. 
. quietly estpost tabstat bripreg7dummy1 bripreg7dummy2 lmonthcat4dummy1 lmonthcat4dummy2 lmonthcat4dumm
> y3 lmonthcat4dummy4 lmonthcat4dummy5 lmonthcat4dummy6 lmonthcat4dummy7 lmonthcat4dummy8 redudummy1 red
> udummy2 redudummy3 redudummy4 spedudummy1 spedudummy2 spedudummy3 spedudummy4 spedudummy5 marcohortdum
> my1 marcohortdummy2 marcohortdummy3 marcohortdummy4 marcatdummy1 marcatdummy2 marcatdummy3 marcatdummy
> 4 marcatdummy5 marcatdummy6 marcohortdummy1 marcohortdummy2 marcohortdummy3 marcohortdummy4 type15adum
> my1 type15adummy2 type15adummy3 type15adummy4 jobssm15adummy1 jobssm15adummy2 jobssm15adummy3 jobssm15
> adummy4 jobssm15adummy5 pld15adummy1 pld15adummy2 divdummy1 divdummy2 birthcat1dummy1 birthcat1dummy2 
> birthcat1dummy3 birthcat1dummy4 birthcat1dummy5 birthcat1dummy6 if group7==. & lmonth == 1, statistics
> (mean sd min max) columns(statistics) 

. quietly esttab . using descUnmatched.csv, replace main(mean) aux(sd) wide nostar unstack noobs nonote 
> label

. 
end of do-file

. do "/Users/fumiyau/Documents/GitHub/OrderMatters/7.KMEstimation.do"

. *KM estimation
. stset lmonth, failure(bev2==1) id(id)

                id:  iduse
     failure event:  bev2 == 1
obs. time interval:  (lmonth[_n-1], lmonth]
 exit on or before:  failure

------------------------------------------------------------------------------
     36,070  total observations
          0  exclusions
------------------------------------------------------------------------------
     36,070  observations remaining, representing
        944  subjects
        697  failures in single-failure-per-subject data
     36,075  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       238

. cd "/Users/fumiyau/Documents/GitHub/OrderMatters/Results/KMEstimation"
/Users/fumiyau/Documents/GitHub/OrderMatters/Results/KMEstimation

. recode bripreg7 1=1 0=2, gen(bripregx7)
(27257 differences between bripreg7 and bripregx7)

. *keep lmonth bev2 id group7 bripregx7
. *bysort id: egen maxlmonth=max(lmonth)
. *keep if lmonth==maxlmonth
. *drop maxlmonth
. *group7 (propensity score matching conducted): 1 Premarital pregnancy 2 other
. *bripregx7 (observed): 1 Premarital pregnancy 2 other
. 
. stsum ,by(group7)

         failure _d:  bev2 == 1
   analysis time _t:  lmonth
                 id:  iduse

         |               incidence       no. of    |------ Survival time -----|
group7   | time at risk     rate        subjects        25%       50%       75%
---------+---------------------------------------------------------------------
       1 |         8322   .0219899           223         12        24        55
       2 |         8250   .0186667           223         15        27        64
---------+---------------------------------------------------------------------
   total |        16572   .0203355           446         14        26        58

. sts graph, by(group7) ytitle("The probability of not having the second child") title("") xtitle("Month
>  at risk from twelve months after first childbearing")  legend(position(6) cols(2) order(1 2) label(1 
> "Premarital Pregnancy (7 months)") label(2 "Other Pregnancy") ) saving(secondbirth_BPPS7.gph,replace)

         failure _d:  bev2 == 1
   analysis time _t:  lmonth
                 id:  iduse
(file secondbirth_BPPS7.gph saved)

. sts test group7

         failure _d:  bev2 == 1
   analysis time _t:  lmonth
                 id:  iduse


Log-rank test for equality of survivor functions

       |   Events         Events
group7 |  observed       expected
-------+-------------------------
1      |       183         168.24
2      |       154         168.76
-------+-------------------------
Total  |       337         337.00

             chi2(1) =       2.66
             Pr>chi2 =     0.1029

. sts test group7,wilcoxon

         failure _d:  bev2 == 1
   analysis time _t:  lmonth
                 id:  iduse


Wilcoxon (Breslow) test for equality of survivor functions

       |   Events         Events        Sum of
group7 |  observed       expected        ranks
-------+--------------------------------------
1      |       183         168.24         4117
2      |       154         168.76        -4117
-------+--------------------------------------
Total  |       337         337.00            0

             chi2(1) =       2.64
             Pr>chi2 =     0.1044

. *Log lank : 0.1029
. *KM Estimation for second childbirth（p value=0.1044, adjusted）
. 
. sts graph, by(bripregx7) ytitle("The probability of not having the second child") title("") xtitle("Mo
> nth at risk from twelve months after first childbearing")  legend(position(6) cols(2) order(1 2) label
> (1 "Premarital Pregnancy (7 months)") label(2 "Other Pregnancy") ) saving(secondbirth_BPOB7.gph,replac
> e)

         failure _d:  bev2 == 1
   analysis time _t:  lmonth
                 id:  iduse
(file secondbirth_BPOB7.gph saved)

. sts test bripreg7

         failure _d:  bev2 == 1
   analysis time _t:  lmonth
                 id:  iduse


Log-rank test for equality of survivor functions

         |   Events         Events
bripreg7 |  observed       expected
---------+-------------------------
0        |       502         529.25
1        |       195         167.75
---------+-------------------------
Total    |       697         697.00

               chi2(1) =       5.99
               Pr>chi2 =     0.0144

. sts test bripreg7,wilcoxon

         failure _d:  bev2 == 1
   analysis time _t:  lmonth
                 id:  iduse


Wilcoxon (Breslow) test for equality of survivor functions

         |   Events         Events        Sum of
bripreg7 |  observed       expected        ranks
---------+--------------------------------------
0        |       502         529.25       -18597
1        |       195         167.75        18597
---------+--------------------------------------
Total    |       697         697.00            0

               chi2(1) =       7.90
               Pr>chi2 =     0.0049

. *Log lank :  0.0049
. *KM Estimation for second childbirth（p value=0.0144, observed）
. 
. label define lmonthl2 0"Month at risk (ref: 1-6)"1"7-12"2"13-24"3"25-36"4"37-60"5"61-96"6"> 97",replac
> e

. label values lmonthcat2 lmonthl2

. label define lmonthl4 0"Month at risk (ref: 1-6)"1"7-12"2"13-24"3"25-36"4"37-48"5"49-60"6"61-84"7"> 85
> ",replace

. label values lmonthcat4 lmonthl4

. 
end of do-file

. do "/Users/fumiyau/Documents/GitHub/OrderMatters/8.Multivariate.do"

. *Discrete time logit models
. cd "/Users/fumiyau/Documents/GitHub/OrderMatters/Results/Regressions"
/Users/fumiyau/Documents/GitHub/OrderMatters/Results/Regressions

. 
. *Model selection
. qui logit bev2 i.lmonthcat4 c.bripreg7 i.redu i.spedu i.marcohort i.marcat i.type15a i.jobssm15a pld15
> a  if group ~=.

. est sto model0

. qui logit bev2 i.lmonthcat4 c.bripreg7 i.redu i.spedu i.marcohort i.marcat i.type15a i.jobssm15a pld15
> a  div   if group ~=.

. est sto model1

. qui logit bev2 i.lmonthcat4 c.bripreg7 i.redu i.spedu i.marcohort i.marcat i.type15a i.jobssm15a pld15
> a  i.birthcat1  if group ~=.

. est sto model2

. qui logit bev2 i.lmonthcat4 c.bripreg7 i.redu i.spedu i.marcohort i.marcat i.type15a i.jobssm15a pld15
> a  div i.birthcat1  if group ~=.

. est sto model3

. qui logit bev2 i.lmonthcat4##c.bripreg7 i.redu i.spedu i.marcohort i.marcat i.type15a i.jobssm15a pld1
> 5a  if group ~=.

. est sto model4

. qui logit bev2 i.lmonthcat4##c.bripreg7 i.redu i.spedu i.marcohort i.marcat i.type15a i.jobssm15a pld1
> 5a div  if group ~=.

. est sto model5

. qui logit bev2 i.lmonthcat4##c.bripreg7 i.redu i.spedu i.marcohort i.marcat i.type15a i.jobssm15a pld1
> 5a i.birthcat1  if group ~=.

. est sto model6

. qui logit bev2 i.lmonthcat4##c.bripreg7 i.redu i.spedu i.marcohort i.marcat i.type15a i.jobssm15a pld1
> 5a  div i.birthcat1  if group ~=.

. est sto model7

. esttab model0 model1 model2 model3 model4 model5 model6 model7 using Secondbirth7_wide2_modelfit.csv, 
> se scalar(N chi2 df_m ll bic aic r2_p) star(† 0.1 * 0.05 ** 0.01 *** 0.001) b(3)  replace label  wide 
> noomitted title(Determinants of second childbirth (left: adjusted right: observed))
(output written to Secondbirth7_wide2_modelfit.csv)

. 
. *Accepted model 
. qui logit bev2 i.lmonthcat4##c.bripreg7 i.redu i.spedu i.marcohort i.marcat i.type15a i.jobssm15a pld1
> 5a div i.birthcat1 if group ~=.

. est sto model1

. qui logit bev2 i.lmonthcat4##c.bripreg7 i.redu i.spedu i.marcohort i.marcat i.type15a i.jobssm15a pld1
> 5a div i.birthcat1

. est sto model2

. esttab  model1 model2  using Secondbirth7_wide2_aftermodelfit_2ndround.csv, se scalar(N chi2 df_m ll a
> ic r2_p) star(# 0.1 * 0.05 ** 0.01 *** 0.001) b(3)  replace label  wide noomitted title(Determinants o
> f second childbirth (left: adjusted right: observed))
(output written to Secondbirth7_wide2_aftermodelfit_2ndround.csv)

. 
. *Predicted hazard
. qui logit bev2 i.lmonthcat4##i.bripreg7 i.redu i.spedu i.marcohort i.marcat i.type15a i.jobssm15a pld1
> 5a div i.birthcat1 if group ~=.

. estpost margins bripreg7, at(lmonthcat4=(0(1)7) ) 

Predictive margins                              Number of obs     =     16,572
Model VCE    : OIM

Expression   : Pr(bev2), predict()

1._at        : lmonthcat4      =           0

2._at        : lmonthcat4      =           1

3._at        : lmonthcat4      =           2

4._at        : lmonthcat4      =           3

5._at        : lmonthcat4      =           4

6._at        : lmonthcat4      =           5

7._at        : lmonthcat4      =           6

8._at        : lmonthcat4      =           7

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
_at#bripreg7 |
        1 0  |   .0062285   .0020848     2.99   0.003     .0021424    .0103146
        1 1  |   .0141315   .0031674     4.46   0.000     .0079235    .0203395
        2 0  |   .0243226   .0044072     5.52   0.000     .0156847    .0329606
        2 1  |    .032043   .0051505     6.22   0.000     .0219481    .0421378
        3 0  |   .0296881   .0041348     7.18   0.000     .0215841    .0377922
        3 1  |   .0319783   .0044343     7.21   0.000     .0232872    .0406695
        4 0  |   .0265125   .0048721     5.44   0.000     .0169634    .0360616
        4 1  |     .03228   .0057198     5.64   0.000     .0210695    .0434906
        5 0  |   .0253908    .005999     4.23   0.000      .013633    .0371485
        5 1  |   .0201031   .0055946     3.59   0.000      .009138    .0310683
        6 0  |   .0084308    .004225     2.00   0.046       .00015    .0167115
        6 1  |   .0162343   .0057475     2.82   0.005     .0049693    .0274992
        7 0  |   .0105527    .004017     2.63   0.009     .0026796    .0184258
        7 1  |   .0118266    .004233     2.79   0.005       .00353    .0201232
        8 0  |   .0010088   .0010146     0.99   0.320    -.0009798    .0029974
        8 1  |   .0103769   .0035614     2.91   0.004     .0033967    .0173571
------------------------------------------------------------------------------

. esttab . using hazardbybripreg7.csv, replace r(b) label wide nostar
(output written to hazardbybripreg7.csv)

. qui logit bev2 i.lmonthcat4##i.bripreg7 i.redu i.spedu i.marcohort i.marcat i.type15a i.jobssm15a pld1
> 5a div i.birthcat1 if group ~=.

. estpost margins bripreg7

Predictive margins                              Number of obs     =     16,572
Model VCE    : OIM

Expression   : Pr(bev2), predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    bripreg7 |
          0  |   .0178972   .0015163    11.80   0.000     .0149254     .020869
          1  |   .0228684    .001817    12.59   0.000     .0193072    .0264295
------------------------------------------------------------------------------

. 
end of do-file

. cd "/Users/fumiyau/Documents/GitHub/OrderMatters/"
/Users/fumiyau/Documents/GitHub/OrderMatters

. log close
      name:  <unnamed>
       log:  /Users/fumiyau/Documents/GitHub/OrderMatters/OrderMattersReplication30Sep2018.log
  log type:  text
 closed on:  30 Sep 2018, 22:28:55
--------------------------------------------------------------------------------------------------------
